## Classify the phone number by countries

In [1]:
# Import libs 
import pandas as pd 
import os

In [2]:
os.chdir(r'C:\Users\Admin\Pytraining')

In [3]:
os.getcwd()

'C:\\Users\\Admin\\Pytraining'

In [4]:
# Read dataset from excel
df_tong = pd.read_excel(r"C:\Users\Admin\Pytraining\exercise-2.xlsx", sheet_name= 'DS Tong');
df_loai = pd.read_excel(r"C:\Users\Admin\Pytraining\exercise-2.xlsx", sheet_name= 'DS Loai');

In [5]:
df_tong

           Phone
0   8.489669e+10
1   8.491567e+10
2   8.490561e+10
3   6.584167e+09
4   6.588429e+09
5   6.581458e+09
6   6.584502e+09
7   8.491279e+10
8   6.091238e+10
9   6.061247e+10
10  6.092418e+10
11  6.581116e+09
12  8.490514e+10
13  6.082416e+10
14  6.587129e+09

In [6]:
df_loai

          Phone
0  8.489669e+10
1  8.491279e+10
2  6.584167e+09
3  6.584502e+09
4  6.092418e+10
5  6.082416e+10

In [32]:
# Check data duplicate of two datagrames (df_tong and df_loai)
merge_df = pd.merge(df_tong, df_loai,on='Phone',how='left',indicator='True')

In [33]:
merge_df

           Phone       True
0   8.489669e+10       both
1   8.491567e+10  left_only
2   8.490561e+10  left_only
3   6.584167e+09       both
4   6.588429e+09  left_only
5   6.581458e+09  left_only
6   6.584502e+09       both
7   8.491279e+10       both
8   6.091238e+10  left_only
9   6.061247e+10  left_only
10  6.092418e+10       both
11  6.581116e+09  left_only
12  8.490514e+10  left_only
13  6.082416e+10       both
14  6.587129e+09  left_only

In [34]:
# Drop data duplicate of df_tong include df_loai
df_final = df_tong.drop([0,3,6,7,10,13])

In [35]:
# reset index of df_final
df_final = df_final.reset_index(drop = True)

In [36]:
df_final

          Phone
0  8.491567e+10
1  8.490561e+10
2  6.588429e+09
3  6.581458e+09
4  6.091238e+10
5  6.061247e+10
6  6.581116e+09
7  8.490514e+10
8  6.587129e+09

In [37]:
# Read information of df_final
df_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Phone   9 non-null      float64
dtypes: float64(1)
memory usage: 200.0 bytes

In [38]:
# Convert datatype of df_final from float64 to string
df_final = df_final.astype(str)

In [39]:
df_final

           Phone
0  84915670343.0
1  84905612373.0
2   6588428867.0
3   6581458312.0
4  60912379725.0
5  60612471231.0
6   6581116237.0
7  84905143569.0
8   6587128817.0

In [16]:
country_list = []
for i in range(len(df_final)):
    if df_final['Phone'][i][0:2] == '84': 
        country_list.append('Vietnam')
    elif df_final['Phone'][i][0:2] == '65':
        country_list.append('Singapore')
    else:
        country_list.append('Malaysia')
           
df_final['Country'] = country_list

In [17]:
df_final

           Phone    Country
0  84915670343.0    Vietnam
1  84905612373.0    Vietnam
2   6588428867.0  Singapore
3   6581458312.0  Singapore
4  60912379725.0   Malaysia
5  60612471231.0   Malaysia
6   6581116237.0  Singapore
7  84905143569.0    Vietnam
8   6587128817.0  Singapore

In [18]:
vn_df = df_final[df_final['Country'] == 'Vietnam'] 
sg_df = df_final[df_final['Country'] == 'Singapore']
my_df = df_final[df_final['Country'] == 'Malaysia']

In [19]:
vn_df

           Phone  Country
0  84915670343.0  Vietnam
1  84905612373.0  Vietnam
7  84905143569.0  Vietnam

In [20]:
sg_df

          Phone    Country
2  6588428867.0  Singapore
3  6581458312.0  Singapore
6  6581116237.0  Singapore
8  6587128817.0  Singapore

In [21]:
my_df

           Phone   Country
4  60912379725.0  Malaysia
5  60612471231.0  Malaysia

In [22]:
# output ra excel 
writer = pd.ExcelWriter('Output.xlsx', engine = 'xlsxwriter')
vn_df.to_excel(writer, sheet_name = 'VN', index = False)
sg_df.to_excel(writer, sheet_name ='SG', index = False)
my_df.to_excel(writer,sheet_name ='MY', index = False)
writer.save()
writer.close()

C:\Users\Admin\anaconda3\lib\site-packages\xlsxwriter\workbook.py:339: UserWarning: Calling close() on already closed file.
  warn("Calling close() on already closed file.")

In [23]:
out_df_vn = pd.read_excel('Output.xlsx', sheet_name = 'VN')

In [24]:
out_df_vn

          Phone  Country
0  8.491567e+10  Vietnam
1  8.490561e+10  Vietnam
2  8.490514e+10  Vietnam

In [25]:
out_df_sg = pd.read_excel('Output.xlsx', sheet_name = 'SG')

In [26]:
out_df_sg

          Phone    Country
0  6.588429e+09  Singapore
1  6.581458e+09  Singapore
2  6.581116e+09  Singapore
3  6.587129e+09  Singapore

In [27]:
out_df_my = pd.read_excel('Output.xlsx', sheet_name = 'MY')

In [28]:
out_df_my

          Phone   Country
0  6.091238e+10  Malaysia
1  6.061247e+10  Malaysia